import React from 'react';

export const data = {
    "EV и последовательные гибриды": [
        {
            "кВт": "0-58,85",
            "ЛС": "до 80",
            "С 1 января 2026 года Ставка": "0,17",
            "С 1 января 2026 года 0-3 лет": "3 400",
            "С 1 января 2026 года Ставка 3-5 лет": "0,26",
            "С 1 января 2026 года 3-5 лет": "5 200"
        },
        {
            "кВт": "58,85-73,55",
            "ЛС": "80-100",
            "С 1 января 2026 года Ставка": "49,56",
            "С 1 января 2026 года 0-3 лет": "991 200",
            "С 1 января 2026 года Ставка 3-5 лет": "82,08",
            "С 1 января 2026 года 3-5 лет": "1 641 600"
        },
        {
            "кВт": "73,56-95,61",
            "ЛС": "100-130",
            "С 1 января 2026 года Ставка": "65,88",
            "С 1 января 2026 года 0-3 лет": "1 317 600",
            "С 1 января 2026 года Ставка 3-5 лет": "95,64",
            "С 1 января 2026 года 3-5 лет": "1 912 800"
        },
        {
            "кВт": "95,62-117,68",
            "ЛС": "130-160",
            "С 1 января 2026 года Ставка": "78,00",
            "С 1 января 2026 года 0-3 лет": "1 560 000",
            "С 1 января 2026 года Ставка 3-5 лет": "111,36",
            "С 1 января 2026 года 3-5 лет": "2 227 200"
        },
        {
            "кВт": "117,69-139,75",
            "ЛС": "160-190",
            "С 1 января 2026 года Ставка": "92,40",
            "С 1 января 2026 года 0-3 лет": "1 848 000",
            "С 1 января 2026 года Ставка 3-5 лет": "129,72",
            "С 1 января 2026 года 3-5 лет": "2 594 400"
        },
        {
            "кВт": "139,76-161,81",
            "ЛС": "190-220",
            "С 1 января 2026 года Ставка": "109,68",
            "С 1 января 2026 года 0-3 лет": "2 193 600",
            "С 1 января 2026 года Ставка 3-5 лет": "151,20",
            "С 1 января 2026 года 3-5 лет": "3 024 000"
        },
        {
            "кВт": "161,82-183,88",
            "ЛС": "220-250",
            "С 1 января 2026 года Ставка": "129,96",
            "С 1 января 2026 года 0-3 лет": "2 599 200",
            "С 1 января 2026 года Ставка 3-5 лет": "176,16",
            "С 1 января 2026 года 3-5 лет": "3 523 200"
        },
        {
            "кВт": "183,89-205,94",
            "ЛС": "250-280",
            "С 1 января 2026 года Ставка": "153,96",
            "С 1 января 2026 года 0-3 лет": "3 079 200",
            "С 1 января 2026 года Ставка 3-5 лет": "205,20",
            "С 1 января 2026 года 3-5 лет": "4 104 000"
        },
        {
            "кВт": "205,95 и выше",
            "ЛС": "от 280",
            "С 1 января 2026 года Ставка": "182,40",
            "С 1 января 2026 года 0-3 лет": "3 648 000",
            "С 1 января 2026 года Ставка 3-5 лет": "239,04",
            "С 1 января 2026 года 3-5 лет": "4 780 800"
        }
    ],
    "Объем 1.0 - 2.0": [
        {
            "кВт": "до 117,68",
            "ЛС": "0-160",
            "С 1 января 2026 года Ставка": "0,17",
            "С 1 января 2026 года 0-3 лет": "3 400",
            "С 1 января 2026 года Ставка 3-5 лет": "0,26",
            "С 1 января 2026 года 3-5 лет": "5 200"
        },
        {
            "кВт": "117,68-139,75",
            "ЛС": "160-190",
            "С 1 января 2026 года Ставка": "45,00",
            "С 1 января 2026 года 0-3 лет": "900 000",
            "С 1 января 2026 года Ставка 3-5 лет": "74,64",
            "С 1 января 2026 года 3-5 лет": "1 492 800"
        },
        {
            "кВт": "139,75-161,81",
            "ЛС": "190-220",
            "С 1 января 2026 года Ставка": "47,64",
            "С 1 января 2026 года 0-3 лет": "952 800",
            "С 1 января 2026 года Ставка 3-5 лет": "79,20",
            "С 1 января 2026 года 3-5 лет": "1 584 000"
        },
        {
            "кВт": "161,81-183",
            "ЛС": "220-250",
            "С 1 января 2026 года Ставка": "50,52",
            "С 1 января 2026 года 0-3 лет": "1 010 400",
            "С 1 января 2026 года Ставка 3-5 лет": "83,88",
            "С 1 января 2026 года 3-5 лет": "1 677 600"
        },
        {
            "кВт": "183,88-205,94",
            "ЛС": "250-280",
            "С 1 января 2026 года Ставка": "57,12",
            "С 1 января 2026 года 0-3 лет": "1 142 400",
            "С 1 января 2026 года Ставка 3-5 лет": "91,92",
            "С 1 января 2026 года 3-5 лет": "1 838 400"
        },
        {
            "кВт": "205,94-228",
            "ЛС": "280-310",
            "С 1 января 2026 года Ставка": "64,56",
            "С 1 января 2026 года 0-3 лет": "1 291 200",
            "С 1 января 2026 года Ставка 3-5 лет": "100,56",
            "С 1 января 2026 года 3-5 лет": "2 011 200"
        },
        {
            "кВт": "228-250",
            "ЛС": "310-340",
            "С 1 января 2026 года Ставка": "72,96",
            "С 1 января 2026 года 0-3 лет": "1 459 200",
            "С 1 января 2026 года Ставка 3-5 лет": "110,16",
            "С 1 января 2026 года 3-5 лет": "2 203 200"
        },
        {
            "кВт": "250-272,13",
            "ЛС": "340-370",
            "С 1 января 2026 года Ставка": "83,16",
            "С 1 января 2026 года 0-3 лет": "1 663 200",
            "С 1 января 2026 года Ставка 3-5 лет": "120,60",
            "С 1 января 2026 года 3-5 лет": "2 412 000"
        },
        {
            "кВт": "272,13-294,2",
            "ЛС": "370-400",
            "С 1 января 2026 года Ставка": "94,80",
            "С 1 января 2026 года 0-3 лет": "1 896 000",
            "С 1 января 2026 года Ставка 3-5 лет": "132,00",
            "С 1 января 2026 года 3-5 лет": "2 640 000"
        },
        {
            "кВт": "294,21-316,26",
            "ЛС": "400-430",
            "С 1 января 2026 года Ставка": "108,00",
            "С 1 января 2026 года 0-3 лет": "2 160 000",
            "С 1 января 2026 года Ставка 3-5 лет": "144,60",
            "С 1 января 2026 года 3-5 лет": "2 892 000"
        },
        {
            "кВт": "316,27-338,33",
            "ЛС": "430-460",
            "С 1 января 2026 года Ставка": "123,24",
            "С 1 января 2026 года 0-3 лет": "2 464 800",
            "С 1 января 2026 года Ставка 3-5 лет": "158,40",
            "С 1 января 2026 года 3-5 лет": "3 168 000"
        },
        {
            "кВт": "338,34 - 367,75",
            "ЛС": "460-500",
            "С 1 января 2026 года Ставка": "140,40",
            "С 1 января 2026 года 0-3 лет": "2 808 000",
            "С 1 января 2026 года Ставка 3-5 лет": "173,40",
            "С 1 января 2026 года 3-5 лет": "3 468 000"
        },
        {
            "кВт": "более 367,76",
            "ЛС": "более 500",
            "С 1 января 2026 года Ставка": "160,08",
            "С 1 января 2026 года 0-3 лет": "3 201 600",
            "С 1 января 2026 года Ставка 3-5 лет": "189,84",
            "С 1 января 2026 года 3-5 лет": "3 796 800"
        }
    ],
    "Объем 2.0 - 3.0": [
        {
            "кВт": "до 117,68",
            "ЛС": "0-160",
            "С 1 января 2026 года Ставка": "0,17",
            "С 1 января 2026 года 0-3 лет": "3 400",
            "С 1 января 2026 года Ставка 3-5 лет": "0,26",
            "С 1 января 2026 года 3-5 лет": "5 200"
        },
        {
            "кВт": "117,68-139,75",
            "ЛС": "160-190",
            "С 1 января 2026 года Ставка": "115,34",
            "С 1 января 2026 года 0-3 лет": "2 306 800",
            "С 1 января 2026 года Ставка 3-5 лет": "172,80",
            "С 1 января 2026 года 3-5 лет": "3 456 000"
        },
        {
            "кВт": "139,75-161,81",
            "ЛС": "190-220",
            "С 1 января 2026 года Ставка": "118,20",
            "С 1 января 2026 года 0-3 лет": "2 364 000",
            "С 1 января 2026 года Ставка 3-5 лет": "175,08",
            "С 1 января 2026 года 3-5 лет": "3 501 600"
        },
        {
            "кВт": "161,81-183,88",
            "ЛС": "220-250",
            "С 1 января 2026 года Ставка": "120,12",
            "С 1 января 2026 года 0-3 лет": "2 402 400",
            "С 1 января 2026 года Ставка 3-5 лет": "177,60",
            "С 1 января 2026 года 3-5 лет": "3 552 600"
        },
        {
            "кВт": "183,88-205,94",
            "ЛС": "250-280",
            "С 1 января 2026 года Ставка": "126,00",
            "С 1 января 2026 года 0-3 лет": "2 520 000",
            "С 1 января 2026 года Ставка 3-5 лет": "183,00",
            "С 1 января 2026 года 3-5 лет": "3 660 000"
        },
        {
            "кВт": "205,94-228",
            "ЛС": "280-310",
            "С 1 января 2026 года Ставка": "131,04",
            "С 1 января 2026 года 0-3 лет": "2 620 800",
            "С 1 января 2026 года Ставка 3-5 лет": "188,52",
            "С 1 января 2026 года 3-5 лет": "3 770 400"
        },
        {
            "кВт": "228-250",
            "ЛС": "310-340",
            "С 1 января 2026 года Ставка": "136,32",
            "С 1 января 2026 года 0-3 лет": "2 726 400",
            "С 1 января 2026 года Ставка 3-5 лет": "193,68",
            "С 1 января 2026 года 3-5 лет": "3 873 600"
        },
        {
            "кВт": "250-272,13",
            "ЛС": "340-370",
            "С 1 января 2026 года Ставка": "141,72",
            "С 1 января 2026 года 0-3 лет": "2 834 400",
            "С 1 января 2026 года Ставка 3-5 лет": "199,08",
            "С 1 января 2026 года 3-5 лет": "3 981 600"
        },
        {
            "кВт": "272,13-294,2",
            "ЛС": "370-400",
            "С 1 января 2026 года Ставка": "147,48",
            "С 1 января 2026 года 0-3 лет": "2 949 600",
            "С 1 января 2026 года Ставка 3-5 лет": "204,72",
            "С 1 января 2026 года 3-5 лет": "4 094 400"
        },
        {
            "кВт": "294,21-316,26",
            "ЛС": "400-430",
            "С 1 января 2026 года Ставка": "153,36",
            "С 1 января 2026 года 0-3 лет": "3 067 200",
            "С 1 января 2026 года Ставка 3-5 лет": "210,48",
            "С 1 января 2026 года 3-5 лет": "4 209 600"
        },
        {
            "кВт": "316,27-338,33",
            "ЛС": "430-460",
            "С 1 января 2026 года Ставка": "159,48",
            "С 1 января 2026 года 0-3 лет": "3 189 600",
            "С 1 января 2026 года Ставка 3-5 лет": "216,36",
            "С 1 января 2026 года 3-5 лет": "4 327 200"
        },
        {
            "кВт": "338,34 - 367,75",
            "ЛС": "460-500",
            "С 1 января 2026 года Ставка": "165,84",
            "С 1 января 2026 года 0-3 лет": "3 316 800",
            "С 1 января 2026 года Ставка 3-5 лет": "222,36",
            "С 1 января 2026 года 3-5 лет": "4 447 200"
        },
        {
            "кВт": "более 367,76",
            "ЛС": "более 500",
            "С 1 января 2026 года Ставка": "172,44",
            "С 1 января 2026 года 0-3 лет": "3 448 800",
            "С 1 января 2026 года Ставка 3-5 лет": "228,60",
            "С 1 января 2026 года 3-5 лет": "4 572 000"
        }

    ]
}



function CalcTable() {
    return (
        <div className="overflow-x-auto max-w-4xl mx-auto mb-12">
            <table className="min-w-full table-auto border-collapse text-sm">
                <thead>
                <tr className="bg-yellow-400 text-center">
                    <th className="border px-4 py-2">кВт</th>
                    <th className="border px-4 py-2">ЛС</th>
                    <th className="border px-4 py-2">Ставка</th>
                    <th className="border px-4 py-2">0-3 лет</th>
                    <th className="border px-4 py-2">Ставка 3-5 лет</th>
                    <th className="border px-4 py-2">3-5 лет</th>
                </tr>
                </thead>
                <tbody>
                {Object.entries(data).map(([category, rows]) => (
                    <React.Fragment key={category}>
                        <tr>
                            <td colSpan="6" className="bg-yellow-300 text-center font-bold py-2">{category}</td>
                        </tr>
                        {rows.map((row, index) => (
                            <tr key={index} className={index % 2 === 0 ? 'bg-gray-100' : 'bg-white'}>
                                <td className="border px-4 py-2">{row.кВт}</td>
                                <td className="border px-4 py-2">{row.ЛС}</td>
                                <td className="border px-4 py-2">{row['С 1 января 2026 года Ставка']}</td>
                                <td className="border px-4 py-2">{row['С 1 января 2026 года 0-3 лет']}</td>
                                <td className="border px-4 py-2">{row['С 1 января 2026 года Ставка 3-5 лет']}</td>
                                <td className="border px-4 py-2">{row['С 1 января 2026 года 3-5 лет']}</td>
                            </tr>
                        ))}
                    </React.Fragment>
                ))}
                </tbody>
            </table>
        </div>
    );
}


export default CalcTable;
